about-android.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>Androidアプリ作成</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Androidアプリ作成"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-10 10:22:04 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="./org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Androidアプリ作成</h1>


    <div class='navbar navbar-fixed-top'>
      <div class='navbar-inner'>
        <div class='container'>
          <a class='brand' href='./index.html'>ねこねここねこ</a>
          <ul class='nav'>
            <li>
              <a href='#sec-1'>Twitterクライアント</a>
            </li>
            <li>
              <a href='#sec-2'>戦略シミュレーションゲーム</a>
            </li>
          </ul>
        </div>
      </div>
    </div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 資料</a>
<ul>
<li><a href="#sec-1-1">1.1 Web</a></li>
</ul>
</li>
<li><a href="#sec-2">2 開発環境導入</a></li>
<li><a href="#sec-3">3 Androidアプリ開発にあたっての基礎</a></li>
<li><a href="#sec-4">4 adbの使い方</a></li>
<li><a href="#sec-5">5 Twitterクライアント作り</a>
<ul>
<li><a href="#sec-5-1">5.1 ListViewの扱い</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 資料</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Web</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>初心者に送る、はじめてのAndroidアプリ開発/小気味の良いアプリをつくるためのTIPS - shimobayashiの日記
<ul>
<li>URL: <a href="http://d.hatena.ne.jp/shimobayashi/20110319/1300516097">http://d.hatena.ne.jp/shimobayashi/20110319/1300516097</a>
</li>
</ul>

</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 開発環境導入</h2>
<div class="outline-text-2" id="text-2">

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Androidアプリ開発にあたっての基礎</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>インテント
</li>
<li>アクティビティ
</li>
</ul>



</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> adbの使い方</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>使えるデバイスの確認
</li>
</ul>




<pre class="example">% adb devices
List of devices attached
HT0B4RX08083    device
</pre>


<ul>
<li>Shellを使う
</li>
</ul>




<pre class="example">% adb shell
</pre>

<ul>
<li>Logcat
</li>
</ul>




<pre class="example">% adb logcat
# もしくは，adb shellの状態で
% logcat
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Twitterクライアント作り</h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> ListViewの扱い</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>ListViewで最後尾までスクロールしたら自動的に要素を追加読み込みするサンプル
  <a href="http://visible-true.blogspot.jp/2010/12/listview.html">http://visible-true.blogspot.jp/2010/12/listview.html</a>
</li>
<li>：Tips 　ListView を使おう　～ 基礎編 ～　その１ - - Google Android -  　雑記帳
  <a href="http://d.hatena.ne.jp/androidprogram/20100628/1277685225">http://d.hatena.ne.jp/androidprogram/20100628/1277685225</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-05-10 10:22:04 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
